<a href="https://colab.research.google.com/github/EunSeong-Jo/2025-1-myclass-BDA/blob/main/inclass/02w_B_0312_pandas_basic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd

s = ['aa', 'bb', 'cc', 'dd', 'ee']
p = pd.Series([99, 32, 55, 11, 45], index = s)

p

aa    99
bb    32
cc    55
dd    11
ee    45
dtype: int64

In [ ]:
p.name = '수학성적'
p.index.name = '이름'

p

이름
aa    99
bb    32
cc    55
dd    11
ee    45
Name: 수학성적, dtype: int64

In [ ]:
p.sort_values()

이름
dd    11
bb    32
ee    45
cc    55
aa    99
Name: 수학성적, dtype: int64

In [ ]:
p.sort_values(ascending=False)

이름
aa    99
cc    55
ee    45
bb    32
dd    11
Name: 수학성적, dtype: int64

In [ ]:
p.sort_index()

이름
aa    99
bb    32
cc    55
dd    11
ee    45
Name: 수학성적, dtype: int64

In [ ]:
p.sort_index(ascending=False)

이름
ee    45
dd    11
cc    55
bb    32
aa    99
Name: 수학성적, dtype: int64

시리즈 기본 통계 함수

In [ ]:
print(p.max())
print(p.min())
print(p.mean())
print(p.median())
print(p.count())
print(p.size)

99
11
48.4
45.0
5
5

In [ ]:
p.describe()

count     5.000000
mean     48.400000
std      32.723081
min      11.000000
25%      32.000000
50%      45.000000
75%      55.000000
max      99.000000
Name: 수학성적, dtype: float64

In [ ]:
s = pd.Series([2, 3, 4, None, 1, 1, np.nan])

s

0    2.0
1    3.0
2    4.0
3    NaN
4    1.0
5    1.0
6    NaN
dtype: float64

In [ ]:
s.values

array([ 2.,  3.,  4., nan,  1.,  1., nan])

In [ ]:
# nan 제외
s.count()

np.int64(5)

In [ ]:
s.value_counts()

1.0    2
2.0    1
3.0    1
4.0    1
Name: count, dtype: int64

In [ ]:
s.value_counts(dropna=False)

1.0    2
NaN    2
2.0    1
4.0    1
3.0    1
Name: count, dtype: int64

In [ ]:
s.value_counts(dropna=False, sort=False)

2.0    1
3.0    1
4.0    1
NaN    2
1.0    2
Name: count, dtype: int64

In [ ]:
s.value_counts(bins=10)

(0.996, 1.3]    2
(1.9, 2.2]      1
(3.7, 4.0]      1
(2.8, 3.1]      1
(1.3, 1.6]      0
(1.6, 1.9]      0
(2.5, 2.8]      0
(2.2, 2.5]      0
(3.1, 3.4]      0
(3.4, 3.7]      0
Name: count, dtype: int64

In [ ]:
s.value_counts(bins=10, sort=False)

(0.996, 1.3]    2
(1.3, 1.6]      0
(1.6, 1.9]      0
(1.9, 2.2]      1
(2.2, 2.5]      0
(2.5, 2.8]      0
(2.8, 3.1]      1
(3.1, 3.4]      0
(3.4, 3.7]      0
(3.7, 4.0]      1
Name: count, dtype: int64

In [ ]:
s.value_counts(bins=[0.5, 1.5, 2], sort=False)

(0.499, 1.5]    2
(1.5, 2.0]      1
Name: count, dtype: int64

데이터 프레임 다루기

In [ ]:
import pandas as pd

df = pd.DataFrame([10, 22, 30 , 42, 56])

df

    0
0  10
1  22
2  30
3  42
4  56

In [ ]:
# index=list('abc')
df = pd.DataFrame([[1, 2, 3], [10, 20, 30], [100, 200, 300]], index=['a', 'b', 'c'])

df

     0    1    2
a    1    2    3
b   10   20   30
c  100  200  300

In [ ]:
df = pd.DataFrame([[1, 2, 3], [10, 20, 30], [100, 200, 300]], index=list('abc'), columns=list('ABC'))

df

     A    B    C
a    1    2    3
b   10   20   30
c  100  200  300

In [ ]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [ ]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
df = pd.DataFrame(np.arange(12).reshape(3, 4))

df

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [ ]:
df = pd.DataFrame(np.random.randint(1, 20, (4, 5)))

df

    0  1   2   3   4
0   7  4  11   8   5
1   9  8  10   6  14
2   8  2  15   8   1
3  17  4  19  19  19

In [ ]:
df = pd.DataFrame(np.random.random((4, 5)))

df

          0         1         2         3         4
0  0.055118  0.270046  0.396824  0.695955  0.065200
1  0.966466  0.989702  0.715856  0.807952  0.834875
2  0.631704  0.988964  0.456440  0.106939  0.935934
3  0.593150  0.106307  0.264327  0.412111  0.476678

In [ ]:
df = pd.DataFrame({'num':[1, 2, 3], 'color':['r', 'g', 'b']})

df

   num color
0    1     r
1    2     g
2    3     b

In [ ]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [ ]:
df.columns

Index(['num', 'color'], dtype='object')

In [ ]:
df = pd.DataFrame({'국어' : (34, 56, 78), '수학' : (12, 35, 75)}, index=['김', '이', '박'])

df

   국어  수학
김  34  12
이  56  35
박  78  75

In [ ]:
df.index

Index(['김', '이', '박'], dtype='object')

In [ ]:
df.columns

Index(['국어', '수학'], dtype='object')

In [ ]:
courses = pd.Series(['spark', 'hadop', 'pyspark'], name='courses')

courses

0      spark
1      hadop
2    pyspark
Name: courses, dtype: object

-----------------

In [ ]:
fess = pd.Series([25, 30, 35], name='fess')

fess

0    25
1    30
2    35
Name: fess, dtype: int64

In [ ]:
df = pd.DataFrame({courses.name : courses, fess.name : fess})

df

   courses  fess
0    spark    25
1    hadop    30
2  pyspark    35

In [ ]:
courses = pd.Series(['spark', 'hadop', 'pyspark'], name='courses')
fess = pd.Series([25, 30, 35], name='fess')

df = pd.concat([courses, fess], axis=1)

df

   courses  fess
0    spark    25
1    hadop    30
2  pyspark    35

In [ ]:
df = pd.concat([courses, fess])

df

0      spark
1      hadop
2    pyspark
0         25
1         30
2         35
dtype: object

In [ ]:
df = pd.DataFrame([courses, fess])

df

             0      1        2
courses  spark  hadop  pyspark
fess        25     30       35

In [ ]:
df.T

   courses fess
0    spark   25
1    hadop   30
2  pyspark   35

In [ ]:
df = pd.DataFrame()

df

Empty DataFrame
Columns: []
Index: []

In [ ]:
courses = pd.Series(['spark', 'hadop', 'pyspark'], name='courses')
df[courses.name] = courses

df

   courses
0    spark
1    hadop
2  pyspark

In [ ]:
fess = pd.Series([25, 30, 35], name='fess')
df[fess.name] = fess

df

   courses  fess
0    spark    25
1    hadop    30
2  pyspark    35

In [ ]:
df = pd.DataFrame([{'국어':70, '수학':80, '영어':90},
                  {'국어':55, '영어':20},
                  {'수학':40, '영어':60}])

df

     국어    수학  영어
0  70.0  80.0  90
1  55.0   NaN  20
2   NaN  40.0  60

In [ ]:
s1 = pd.Series([10, 20, 30, 40])
s2 = pd.Series([15, 25, 35, 45])
s3 = pd.Series([100, 200, 300, 400])

In [ ]:
s1

0    10
1    20
2    30
3    40
dtype: int64

In [ ]:
df = pd.DataFrame({'국어':s1, '영어':s2, '수학':s3})

df

   국어  영어   수학
0  10  15  100
1  20  25  200
2  30  35  300
3  40  45  400

In [ ]:
df.index = ['김', '이', '박', '최']

df

   국어  영어   수학
김  10  15  100
이  20  25  200
박  30  35  300
최  40  45  400

In [ ]:
df = pd.DataFrame({'A':pd.Series([10, 20, 30], index=[0, 1, 2]),
                  'B':pd.Series([3, 2, 1], index=[1, 2, 3])})

df

      A    B
0  10.0  NaN
1  20.0  3.0
2  30.0  2.0
3   NaN  1.0

In [ ]:
s1 = pd.Series([10, 20, 30, 40], index=['김', '이', '박', '최'])
s2 = pd.Series([15, 25, 35, 45], index=['김', '이', '박', '장'])
s3 = pd.Series([100, 200, 300, 400])

In [ ]:
df = pd.DataFrame({'국어':s1, '수학':s2, '영어':s3}, index=list('김이박최'))

df

   국어    수학  영어
김  10  15.0 NaN
이  20  25.0 NaN
박  30  35.0 NaN
최  40   NaN NaN

In [ ]:
d = {'col1':[1, 2], 'col2':[3, 4]}
df = pd.DataFrame(data = d)

df

   col1  col2
0     1     3
1     2     4

In [ ]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [ ]:
df = pd.DataFrame(data = d, dtype=np.int8)
df.dtypes

col1    int8
col2    int8
dtype: object

날짜를 위한 함수

In [ ]:
dates = pd.date_range('20250101', periods=6)

dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates = pd.date_range('20250101', end='20250120')

dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06', '2025-01-07', '2025-01-08',
               '2025-01-09', '2025-01-10', '2025-01-11', '2025-01-12',
               '2025-01-13', '2025-01-14', '2025-01-15', '2025-01-16',
               '2025-01-17', '2025-01-18', '2025-01-19', '2025-01-20'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='3d')

dates

DatetimeIndex(['2025-01-01', '2025-01-04', '2025-01-07', '2025-01-10',
               '2025-01-13', '2025-01-16'],
              dtype='datetime64[ns]', freq='3D')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='3h')

dates

DatetimeIndex(['2025-01-01 00:00:00', '2025-01-01 03:00:00',
               '2025-01-01 06:00:00', '2025-01-01 09:00:00',
               '2025-01-01 12:00:00', '2025-01-01 15:00:00'],
              dtype='datetime64[ns]', freq='3h')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='3w')

dates

C:\Users\asus\AppData\Local\Temp\ipykernel_6432\3641989666.py:1: FutureWarning: 'w' is deprecated and will be removed in a future version, please use 'W' instead.
  dates = pd.date_range('20250101', periods=6, freq='3w')

DatetimeIndex(['2025-01-05', '2025-01-26', '2025-02-16', '2025-03-09',
               '2025-03-30', '2025-04-20'],
              dtype='datetime64[ns]', freq='3W-SUN')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='w')

dates

C:\Users\asus\AppData\Local\Temp\ipykernel_6432\186281207.py:1: FutureWarning: 'w' is deprecated and will be removed in a future version, please use 'W' instead.
  dates = pd.date_range('20250101', periods=6, freq='w')

DatetimeIndex(['2025-01-05', '2025-01-12', '2025-01-19', '2025-01-26',
               '2025-02-02', '2025-02-09'],
              dtype='datetime64[ns]', freq='W-SUN')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='w-tue')

dates

DatetimeIndex(['2025-01-07', '2025-01-14', '2025-01-21', '2025-01-28',
               '2025-02-04', '2025-02-11'],
              dtype='datetime64[ns]', freq='W-TUE')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='ME')

dates

DatetimeIndex(['2025-01-31', '2025-02-28', '2025-03-31', '2025-04-30',
               '2025-05-31', '2025-06-30'],
              dtype='datetime64[ns]', freq='ME')

In [ ]:
dates = pd.date_range('20250101', periods=6, freq='MS')

dates

DatetimeIndex(['2025-01-01', '2025-02-01', '2025-03-01', '2025-04-01',
               '2025-05-01', '2025-06-01'],
              dtype='datetime64[ns]', freq='MS')

In [ ]:
df = pd.DataFrame(np.random.rand(6, 4), index=dates, columns=list('ABCD'))

df

                   A         B         C         D
2025-01-01  0.675894  0.269869  0.071895  0.503488
2025-02-01  0.622522  0.395387  0.724006  0.660668
2025-03-01  0.082335  0.861728  0.556956  0.468112
2025-04-01  0.566816  0.459124  0.664738  0.700881
2025-05-01  0.155518  0.651777  0.207638  0.167452
2025-06-01  0.849295  0.418028  0.528348  0.554454

In [ ]:
df2 = pd.DataFrame({
        "A": 1.0,
        "B": pd.Timestamp("20260302"),
        "C": pd.Series(np.arange(1, 3, .5)),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo"
      })
df2

     A          B    C  D      E    F
0  1.0 2026-03-02  1.0  3   test  foo
1  1.0 2026-03-02  1.5  3  train  foo
2  1.0 2026-03-02  2.0  3   test  foo
3  1.0 2026-03-02  2.5  3  train  foo

In [ ]:
df2.dtypes

A          float64
B    datetime64[s]
C          float64
D            int32
E         category
F           object
dtype: object

---------------